# ZCoordinate

## Description
Returns the Z coordinate of the object relative to the object's layer plane.

```pascal
FUNCTION ZCoordinate(c : CRITERIA): REAL;
```

```python
def vs.ZCoordinate(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|The search criteria string.|

## Remarks
Valid objects are PIOs, Symbols and Loci

## Version
Availability: from Vectorworks 2011

## Category
* Criteria